# БАЗА ДАННЫХ --------------------------
DB_HOST = 'localhost'  # Хост базы данных
DB_PORT = 3306  # Порт базы данных
DB_USER = 'u2948470_default'  # Имя пользователя базы данных
DB_PASSWORD = 'JjWs1WV28JIh93Lw'  # Пароль пользователя базы данных
DB_NAME = 'u2948470_default'  # Имя базы данных
# БОТ ----------------------------------
BOT_TOKEN = "7836783041:AAFtLuQazBhqUs78zrjek9CB2W5TE8vmmOI"  # Токен бота
CHANNEL_IDS = [
    # Telegram ID каналов, на которые нужна подписка (каждый с новой строки и ',' в конце; бот должен быть администратором в этих каналах)
    "@test_python_channel2",
    "@test_channel12313",
]
ADMIN_IDS = [  # Telegram ID администраторов бота (каждый с новой строки и ',' в конце)
    # 7836783041,
]
BUTTON_URL = 'http://37.140.192.35:8000/'  # URL который будет в кнопке авторизации пользователя в Телеграмм боте
